[
    {
        "name": "The Dark Knight",
        "imdb_info": {
            "url": "https://www.imdb.com/title/tt0468569/",
            "movie_id": "tt0468569"
        },
        "basic_info": {
            "genre": " Action Crime Drama",
            "year": "2008",
            "duration": "2h 32m",
            "actors": " Christian Bale, Heath Ledger",
            "directors": "Christopher Nolan "
        },
        "quantitative_info": {
            "ranking": "3",
            "rating": "8.984378110538634",
            "review_num": "8.1K",
            "top_review_content": "Best movie ever. Heath ledger's work is phenomenal no words......"
        }
    },
    {
        "name": "The Dark Knight Rises",
        "imdb_info": {
            "url": "https://www.imdb.com/title/tt1345836/",
            "movie_id": "tt1345836"
        },
        "basic_info": {
            "genre": " Action Crime Drama",
            "year": "2012",
            "duration": "2h 44m",
            "actors": " Christian Bale, Tom Hardy",
            "directors": "Christopher Nolan "
        },
        "quantitative_info": {
            "ranking": "69",
            "rating": "8.329381460247408",
            "review_num": "3.6K",
            "top_review_content": "Christopher Nolan has outdone himself with this one. At 3.30 in the morning, I was tired. Just getting out of it, I've never been so awake. Perhaps what set this film apart from his other films was that it had a genuine emotional heartbeat. I felt that this was a flaw of Nolan's other films - the vision of emotion was there, but it was hollow. In this I bought it. I felt it, hero and villain alike.Christian Bale was typically brilliant as Batman, and I felt that Bruce Wayne was more heavily embraced in this final installment. Bale added emotional depth to the character - a plot point that I think went astray in The Dark Knight - picking up from the development made in Batman Begins.Tom Hardy as Bane was quite simply, terrifying. No longer a dunderhead \"enforcer\", but one of the criminal masterminds behind \"Gotham's Reckoning\", coupled with a physical dominance strong enough to send shivers down your spine.Anne Hathaway as Selina Kyle defied my expectations. Hands up who was not entirely convinced that that girl from the Princess Diaries could handle an intensely physical role like Catwoman. But here I am, hugely impressed. She added immeasurably to the value of the film.Marion Cotillard fulfilled the role of Miranda Tate admirably, though I suspect this was the most underdeveloped character of the film - though after watching, I can see why.The unsung hero of The Dark Knight Rises is Michael Caine as Alfred. A heartfelt performance that helps drive the emotional content of the film, helping Nolan sell his most well-rounded film to date. Caine's performance in both presence and absence.Special mention goes to Joseph Gordon Levitt, who is consistently proving himself to be a big player in the Hollywood game. His role as officer Blake felt like there could've been more, but it may just have come all a bit much. It was a great performance, and Levitt sunk his teeth into role. If you can, go see this in IMAX. If any film was to sell the format to skeptics, The Dark Knight Rises would be IT. I'm happy Nolan stuck to his guns and shot in 2D. 3D would have been unnecessary. I suppose at this point, I have to turn my focus on Nolan. If he ever reads this... aspiring filmmaker to filmmaker, I've never been so envious, jealous in all my life. It's a film that leaves me floundering, wondering what I could possibly do to get anywhere near this ballpark. Well done. I think an Oscar Nomination is in order.From here, I'm not sure what to expect of the future. Does our imagination carry us forward, or do the studios? Time will tell.10/10"
        }
    }
][
    {
        "name": "Farewell My Concubine",
        "imdb_info": {
            "url": "https://www.imdb.com/title/tt0106332/",
            "movie_id": "tt0106332"
        },
        "basic_info": {
            "genre": "Drama/Music/Romance",
            "year": "1993",
            "duration": "2h 51m",
            "actors": "Leslie Cheung, Fengyi Zhang, Gong Li, You Ge",
            "directors": "Kaige Chen"
        },
        "quantitative_info": {
            "ranking": "3",
            "rating": "8.1",
            "rating_num": "28,128",
            "short_description": "Two boys meet at an opera training school in Peking in 1924. Their resulting friendship will span nearly 70 years and will endure some of the most troublesome times in China's history."
        }
    }
][
    {
        "name": "Grave of the Fireflies",
        "imdb_info": {
            "url": "https://www.imdb.com/title/tt0095327/",
            "movie_id": "tt0095327"
        },
        "basic_info": {
            "genre": " Animation Drama War",
            "year": "1988",
            "duration": "1h 29m",
            "actors": " Tsutomu Tatsumi, Ayano Shiraishi",
            "directors": "Isao Takahata "
        },
        "quantitative_info": {
            "ranking": "48",
            "rating": "8.446210283968627",
            "review_num": "915",
            "top_review_content": "Being my first Anime review I thought I'd start off with my one of my favourite pieces of work from who else but Studio Ghibli. Ghibli have rarely produced anime that doesn't fall short of great but Graveyard is something different indeed.Set in the aftermath of World War II, Graveyard is focused on the lives of a caring brother and his young sister (Setsuko and Seita) and how they struggle against both the elements of wartime and a depreciating Japanese empire. The most striking thing about Graveyard is probably how real everything seems. The animation is very unconventional to the likes of say Spirited Away or Laputa but in a good way. The horror of war is beautifully realised through the animation, whether it be the American destruction being shown or the bleak outlook on peoples lives, namely the two main characters. Thankfully it earns every shred of emotion it conveys through these two sympathetic characters that only the coldest of hearts wouldn't warm up to.\nAvoiding any Hollywood sentimentality, it is often a bleak and depressing perspective depicted but all the more brutally powerful in the process. With my eyes welling up through the duration of the film, it occured to me just how well the Director understands what raw heartfelt emotion is and how to play the audiences heart strings. Nevertheless nothing is shown in a heavy handed approach, no empthasis is put on the Americans nor is there any special attention taken to the war details. If anything the citizens of Japan are shown in the coldest light often giving little help to the plight of others, but demonstrating furthermore what desperate situation everyone is in.Takahata instead decides to focus on the plight of it's title characters against the background of war. With the empire of Japan in crisis and food shortages everywhere it is heart breaking to see a brother struggle to meet ends meet for his sister. Due to the approach taken it borders on being horrifying but fortunately the tone is changed with the spirit put into Setsuko's character. Much like 'The Pianist' the issue is not the war but the struggle and will to survive in it. This is clearly displayed in a plot that revolves around the downward spiral Setsuko trying to feed himself and more importantly the younger and more vulnerable sister Seita. The animation though detailed and indeed beautiful in some sequences (namely relating to the title), is not by any means flashy but captures emotions and interactions between the characters perfectly. It's the perfect mixture of such animation, realistic and highly likeable characters that makes the whole film one tearful experience. Dealing with such difficult issues it's very hard to imagine this being a film and if it was I don't think it would of been done as well.Part of the brilliance also comes from symbology and the association to many different worlds in such a understanding depiction. The child, Seita, is nothing short of perfection in child like behaviour happily oblivious to the desperate situation, amusing herself with simplicity and the quirks of nature and the outdoors. The older brother Setsuko who must carry the burdon of everything is also perfectly portrayed and to watch there decent is painful to say the least. To struggle is one thing but to have shock, shattered dreams and be depended on is something anyone can empthasise with.\nThere may be some people who will shy away from Anime, disregarding it as a mere cartoon. To those people and everyone else I recommend Graveyard as the tonic, which can be appreciated by anyone with a heart and soul. Among the finest pieces of Anime created and one of the most touching war films ever made."
        }
    },
    {
        "name": "Cinema Paradiso",
        "imdb_info": {
            "url": "https://www.imdb.com/title/tt0095765/",
            "movie_id": "tt0095765"
        },
        "basic_info": {
            "genre": " Drama Romance",
            "year": "1988",
            "duration": "2h 35m",
            "actors": " Philippe Noiret, Enzo Cannavale",
            "directors": "Giuseppe Tornatore "
        },
        "quantitative_info": {
            "ranking": "52",
            "rating": "8.42853914222641",
            "review_num": "585",
            "top_review_content": "One of the best films ever made... And of course one of the best soundtracks ever."
        }
    },
    {
        "name": "Die Hard",
        "imdb_info": {
            "url": "https://www.imdb.com/title/tt0095016/",
            "movie_id": "tt0095016"
        },
        "basic_info": {
            "genre": " Action Thriller",
            "year": "1988",
            "duration": "2h 12m",
            "actors": " Bruce Willis, Alan Rickman",
            "directors": "John McTiernan "
        },
        "quantitative_info": {
            "ranking": "119",
            "rating": "8.220368228025029",
            "review_num": "1.1K",
            "top_review_content": "Bruce Willis is stirring up trouble for the bad guys in \"Die Hard.\" In the first of three awesome films, he stars as Lt. John McClane, a New York police officer, who has been invited to the wrong Christmas party.This is an action film for future actors and directors to watch and use as a model because it is what an action film should be. I have seen many action films in my life, but this ranks at the top as it has all the right components. Action packed sequences, explosions, special effects and most of all superb performances with excellent dialogue.\"Die Hard\" is a movie I will not soon forget because the story is so well crafted. Though there are no twists or curves thrown at the audience, the audience can be assured they will be treated to two hours of non-stop action from beginning to end.\"Die Hard\" did not only produce great action and explosions but future stars as well. I am talking about Clarence Gilyard Jr. who starred in Walker, Texas Ranger and Reginald VelJohnson who starred in the series \"Family Matters.\" These two actors were pivotal to this film in their respective roles.Two other names to keep in mind while thinking of key performers are Bonnie Bedelia and Alan Rickman. I was blown away when I saw the impact they had on this film. It is as if they came in and said 'Okay boys, watch out I'm taking over.\" They certainly did that; however, nobody could have done better than the impact performer himself Bruce Willis.On a scale of 1-10; \"Die Hard\" is given a 100 by yours truly. My only regret would be that the movie ended. I wish there was more to see in this film. I CAN'T WAIT TO SEE \"DIE HARD\" AGAIN."
        }
    },
    {
        "name": "My Neighbor Totoro",
        "imdb_info": {
            "url": "https://www.imdb.com/title/tt0096283/",
            "movie_id": "tt0096283"
        },
        "basic_info": {
            "genre": " Animation Comedy Family",
            "year": "1988",
            "duration": "1h 26m",
            "actors": " Hitoshi Takagi, Noriko Hidaka",
            "directors": "Hayao Miyazaki "
        },
        "quantitative_info": {
            "ranking": "171",
            "rating": "8.095944274577654",
            "review_num": "546",
            "top_review_content": "Professor Tatsuo Kusakabe moves his daughters Satsuki and Mei to an old house in the country near the hospital where his wife Yasuko is convalescencing. The girls find tiny soot sprites scurrying away from the light. Mei discovers forest spirit Totoro sleeping in a giant tree. The girls are waiting for their father at the bus stop. He's late. Mei is falling asleep when Totoro shows up. Satsuki gives him an umbrella and he's overjoyed. He gives the girls a gift of acorns as he boards the cat-bus.It's a gentle story with cute characters and an adorable spirit from legendary animator Hayao Miyazaki. The drama isn't that heightened but it's a great coming-of-age story nonetheless. Totoro discovering the fun of raindrops on the umbrella is pure joy. There is simply an endearing gentleness that extend even to the closing credits animation."
        }
    }
][
    {
        "name": "The Shawshank Redemption",
        "imdb_info": {
            "url": "https://www.imdb.com/title/tt0111161/",
            "movie_id": "tt0111161"
        },
        "basic_info": {
            "genre": "Drama",
            "year": "1994",
            "duration": "2h 22m",
            "actors": "Tim Robbins, Morgan Freeman, Bob Gunton, William Sadler",
            "directors": "Frank Darabont"
        },
        "quantitative_info": {
            "ranking": "1",
            "rating": "9.3",
            "rating_num": "2,579,631",
            "short_description": "Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency."
        }
    },
    {
        "name": "Léon: The Professional",
        "imdb_info": {
            "url": "https://www.imdb.com/title/tt0110413/",
            "movie_id": "tt0110413"
        },
        "basic_info": {
            "genre": "Action/Crime/Drama",
            "year": "1994",
            "duration": "1h 50m",
            "actors": "Jean Reno, Gary Oldman, Natalie Portman, Danny Aiello",
            "directors": "Luc Besson"
        },
        "quantitative_info": {
            "ranking": "2",
            "rating": "8.5",
            "rating_num": "1,124,167",
            "short_description": "12-year-old Mathilda is reluctantly taken in by Léon, a professional assassin, after her family is murdered. An unusual relationship forms as she becomes his protégée and learns the assassin's trade."
        }
    },
    {
        "name": "Farewell My Concubine",
        "imdb_info": {
            "url": "https://www.imdb.com/title/tt0106332/",
            "movie_id": "tt0106332"
        },
        "basic_info": {
            "genre": "Drama/Music/Romance",
            "year": "1993",
            "duration": "2h 51m",
            "actors": "Leslie Cheung, Fengyi Zhang, Gong Li, You Ge",
            "directors": "Kaige Chen"
        },
        "quantitative_info": {
            "ranking": "3",
            "rating": "8.1",
            "rating_num": "28,128",
            "short_description": "Two boys meet at an opera training school in Peking in 1924. Their resulting friendship will span nearly 70 years and will endure some of the most troublesome times in China's history."
        }
    },
    {
        "name": "Forrest Gump",
        "imdb_info": {
            "url": "https://www.imdb.com/title/tt0109830/",
            "movie_id": "tt0109830"
        },
        "basic_info": {
            "genre": "Drama/Romance",
            "year": "1994",
            "duration": "2h 22m",
            "actors": "Tom Hanks, Robin Wright, Gary Sinise, Sally Field",
            "directors": "Robert Zemeckis"
        },
        "quantitative_info": {
            "ranking": "4",
            "rating": "8.8",
            "rating_num": "1,990,014",
            "short_description": "The presidencies of Kennedy and Johnson, the Vietnam War, the Watergate scandal and other historical events unfold from the perspective of an Alabama man with an IQ of 75, whose only desire is to be reunited with his childhood sweetheart."
        }
    },
    {
        "name": "Life Is Beautiful",
        "imdb_info": {
            "url": "https://www.imdb.com/title/tt0118799/",
            "movie_id": "tt0118799"
        },
        "basic_info": {
            "genre": "Comedy/Drama/Romance",
            "year": "1997",
            "duration": "1h 56m",
            "actors": "Roberto Benigni, Nicoletta Braschi, Giorgio Cantarini, Giustino Durano",
            "directors": "Roberto Benigni"
        },
        "quantitative_info": {
            "ranking": "5",
            "rating": "8.6",
            "rating_num": "675,167",
            "short_description": "When an open-minded Jewish waiter and his son become victims of the Holocaust, he uses a perfect mixture of will, humor, and imagination to protect his son from the dangers around their camp."
        }
    }
]